{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences","layers":[{"class_name":"Dense","config":{"units":20,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense48","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.5266842882913484,"noise_shape":null,"seed":null,"name":"dropout_Dropout31","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense49","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5266842882913484,"noise_shape":null,"seed":null,"name":"dropout_Dropout32","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense50","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./confidences.weights.bin"],"weights":[{"name":"dense_Dense48/kernel","shape":[512,20],"dtype":"float32"},{"name":"dense_Dense48/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense49/kernel","shape":[20,20],"dtype":"float32"},{"name":"dense_Dense49/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense50/kernel","shape":[20,1],"dtype":"float32"}]}]}