{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences","layers":[{"class_name":"Dense","config":{"units":2,"activation":"softsign","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense342","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.38102995043552296,"noise_shape":null,"seed":null,"name":"dropout_Dropout249","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"softsign","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense343","trainable":true}},{"class_name":"Dropout","config":{"rate":0.38102995043552296,"noise_shape":null,"seed":null,"name":"dropout_Dropout250","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"softsign","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense344","trainable":true}},{"class_name":"Dropout","config":{"rate":0.38102995043552296,"noise_shape":null,"seed":null,"name":"dropout_Dropout251","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"softsign","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense345","trainable":true}},{"class_name":"Dropout","config":{"rate":0.38102995043552296,"noise_shape":null,"seed":null,"name":"dropout_Dropout252","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense346","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./confidences.weights.bin"],"weights":[{"name":"dense_Dense342/kernel","shape":[512,2],"dtype":"float32"},{"name":"dense_Dense342/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense343/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense343/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense344/kernel","shape":[2,100],"dtype":"float32"},{"name":"dense_Dense344/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense345/kernel","shape":[100,100],"dtype":"float32"},{"name":"dense_Dense345/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense346/kernel","shape":[100,1],"dtype":"float32"}]}]}