{"modelTopology":{"class_name":"Sequential","config":{"name":"crossex","layers":[{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense261","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dense","config":{"units":25,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense262","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense263","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense264","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./crossex.weights.bin"],"weights":[{"name":"dense_Dense261/kernel","shape":[512,1],"dtype":"float32"},{"name":"dense_Dense261/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense262/kernel","shape":[1,25],"dtype":"float32"},{"name":"dense_Dense262/bias","shape":[25],"dtype":"float32"},{"name":"dense_Dense263/kernel","shape":[25,5],"dtype":"float32"},{"name":"dense_Dense263/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense264/kernel","shape":[5,1],"dtype":"float32"}]}]}